---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.DividePerimeter
source: html/8e97b4d9-1db3-54dc-e1fe-3fa751954a68.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.DividePerimeter Property

If this is true, zones with exterior boundaries on each floor of the building will be divided based on geometric criteria.

## Syntax (C#)
```csharp
public bool DividePerimeter { get; set; }
```

## Remarks
When the AnalysisType is ConceptualMasses, the division of the perimeter zones is based on the four compass directions.
 The quadrants will be True N, S, E, and W. The division of the quadrants will be along the axis of True NW to SE and True SW to NE.
 The intersection of the quadrants will be placed at the centroid of the zone.
 When the AnalysisType is not ConceptualMasses, the division of the perimeter zones is based on the difference of orientation, maximum length and depth.
 Any exterior surfaces that have an angle of 45 degrees or more between them will be divided into separate zones.
 Zones greater than 50 ft. will be divided equally. The CoreOffset will determine the depth of the zones.
 The purpose of these divisions is to ensure that auto-generated zoning is appropriate for thermal loads generated by the relative position of the building to the sun path.